# 06 Working with Text Data
This Tutorial will cover ow to work with Text Data in Pandas.
Many time we recive a dataset even if we are working with something like a string the data may not be in idel shape for us to perform our proper Data Analysis.
We may have some problems like Capitalization , sometimes we have more that one things in string and we need to split it out and many more. In order to solve those problems Pandas include many diffrent string methods that we can call on a DataFrame or Series to fix those Problems.

In [1]:
#importing Libraries
import pandas as pd

In [2]:
#import Data (Data Represent every employee who is employeed by the city of chicago)
data = pd.read_csv("datasets/chicago.csv").dropna(how='all')
data

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [4]:
#summary of the dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null object
dtypes: object(4)
memory usage: 1.2+ MB

In [5]:
#unique category and Total count by getting this we get to know 32000 string about 35 unique 
#values is a high ratio so creating striong to category
data['Department'].nunique() , data['Department'].count()
data['Department'] = data['Department'].astype('category')
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [6]:
#comman string Methods
# lower() , upper() , title()
#this is how we can implememnt amny str method on a  str object
"Amanpreet Singh".lower()
"Amanpreet Singh".upper()

'AMANPREET SINGH'

In [7]:
#but this is not going to work on dataframe or series object here you can see
data['Name'].lower()

AttributeError: 'Series' object has no attribute 'lower'

In [8]:
#way of implementation of str methods on DataFrame object or series Object.
data['Name'].str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32057    Zygadlo,  Michael J
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
Name: Name, Length: 32062, dtype: object

In [9]:
#use ofreplace method
"Amanpreet".replace("preet",'')#this is how we can use in simple str
data['Department'].head() #here you can see this there is mngmnt instead of Management
data['Department'] = data['Department'].str.replace('MGMNT','MANAGEMENT')

In [10]:
"""
Another usecase here you can see we have a column name as Annual Salary that is also in a str
data type. In this we are not able to perform any mathematical functionality.
So we have to handle it. Firstly we have to remove the $ and then convert that into a float
"""
data['Employee Annual Salary'] = data['Employee Annual Salary'].str.replace('$','').astype('float')

In [11]:
#now we can perfrom any time of numeric functionality
data['Employee Annual Salary'].sum()
data['Employee Annual Salary'].std()
data['Employee Annual Salary'].mean()

80204.17863389682

#Filter with str method
Let's suppose i want to filter rows which consist of water in department.

In [12]:
#the best way before mentioning condition we firstly have to take care about the case senstive problem.
data['Position Title'].str.lower().str.contains('water') #will return True or False
condition = data['Position Title'].str.lower().str.contains('water')
data[condition].head(50)

# we can also do by using custom function such
def str_finder(word):
    if 'water' in word.lower():
        return True
    else:
        return False
a = data['Position Title'].apply(str_finder)
data[a]

#but the best way is to use str methods

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,82044.0
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MANAGEMENT,109272.0
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
...,...,...,...,...
29669,"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MANAGEMENT,111192.0
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MANAGEMENT,89676.0
30544,"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MANAGEMENT,115704.0
30991,"WILLIAMS, MATTHEW",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
31405,"WOODRIDGE, ROBERT L",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0

In [13]:
#condition2
condition2= data['Position Title'].str.lower().str.startswith('water')
data[condition2]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,82044.0
1054,"ASHLEY, KARMA T",WATER CHEMIST II,WATER MANAGEMENT,82044.0
1079,"ATKINS, JOANNA M",WATER CHEMIST II,WATER MANAGEMENT,82044.0
1181,"AZEEM, MOHAMMED A",WATER CHEMIST II,WATER MANAGEMENT,53172.0
...,...,...,...,...
28574,"THREATT, DENISE R",WATER QUALITY INSPECTOR,WATER MANAGEMENT,62004.0
28602,"TIGNOR, DARRYL B",WATER RATE TAKER,WATER MANAGEMENT,78948.0
28955,"TRAVIS COOK, LESLIE R",WATER RATE TAKER,WATER MANAGEMENT,78948.0
29584,"VELAZQUEZ, JOHN",WATER RATE TAKER,WATER MANAGEMENT,78948.0
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MANAGEMENT,89676.0

In [14]:
#condition3
condition3 = data['Position Title'].str.lower().str.endswith('ist')
data[condition3]

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,99840.0
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,81948.0
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,89880.0
472,"ALLEN, ROBERT",MACHINIST,WATER MANAGEMENT,94328.0
705,"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,91476.0
...,...,...,...,...
31667,"YODER, TERESA G",ARCHIVAL SPECIALIST,PUBLIC LIBRARY,74304.0
31688,"YOUNGBLOOM, LAURENCE G",CRIMES SURVEILLANCE SPECIALIST,OEMC,19676.8
31717,"YOUNG, KIMBERLY M",SR PROCUREMENT SPECIALIST,PROCUREMENT,68556.0
31837,"ZAPATA, HUGO",SR PROCUREMENT SPECIALIST,PROCUREMENT,87324.0
31918,"ZEMKE, RICHARD P",MACHINIST,AVIATION,94328.0

In [15]:
#More str method which is used to remove white spaces from string strip(),lstrip(),rstrip()

In [18]:
"    Amanpreet Singh   ".strip() #remove all spaces either in lefty or either in right
# "    Amanpreet Singh  ".lstrip() #remove spaces from left(from the begigning)
# "    Amanpreet Singh        ".rstrip() #remove spaces from right

'Amanpreet Singh'

In [27]:
#removing white spaces from dataframe
data['Name'] = data['Name'].str.lstrip().str.rstrip()
data['Position Title'] = data['Position Title'].str.lstrip().str.rstrip()
data

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,89880.0
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,106836.0
...,...,...,...,...
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [32]:
#str Methods on index and columns
data = data.set_index('Name')

KeyError: "None of ['Name'] are in the columns"

In [34]:
data.index

Index(['AARON,  ELVIA J', 'AARON,  JEFFERY M', 'AARON,  KARINA',
       'AARON,  KIMBERLEI R', 'ABAD JR,  VICENTE M', 'ABARCA,  ANABEL',
       'ABARCA,  EMMANUEL', 'ABASCAL,  REECE E', 'ABBASI,  CHRISTOPHER',
       'ABBATACOLA,  ROBERT J',
       ...
       'ZWIT,  JEFFREY J', 'ZWOLFER,  MATTHEW W', 'ZYCH,  MATEUSZ',
       'ZYDEK,  BRYAN', 'ZYGADLO,  JOHN P', 'ZYGADLO,  MICHAEL J',
       'ZYGOWICZ,  PETER J', 'ZYMANTAS,  MARK E', 'ZYRKOWSKI,  CARLO E',
       'ZYSKOWSKI,  DARIUSZ'],
      dtype='object', name='Name', length=32062)

In [36]:
#remove all the spaces and make name as title
data.index.str.strip().str.title()

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [39]:
#reassign the index
data.index = data.index.str.strip().str.title()

In [40]:
data.index

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [43]:
#working on columns
data.columns = data.columns.str.strip().str.upper()

In [44]:
data.columns

Index(['POSITION TITLE', 'DEPARTMENT', 'EMPLOYEE ANNUAL SALARY'], dtype='object')

In [46]:
#spit method in str
#lets have a look on example first
"My name is Amanpreet Singh".split()
"""
#split is a method which will split our string on the basis of space
Bassically split method consist of single argument which represents whats called teh delimiter 
or separator.And it will returna list whith all kind of seperate components.
The default delimiter of split method is one space(' ').
So this single space is just used as the separator where we can divide those section of string up
"""

['My', 'name', 'is', 'Amanpreet', 'Singh']

In [58]:
"""
Lets discuss a use case in which we can use this split method. We have  a column name as Name
Which consist of first name and last name . My requirment is to check the comman last name.
So in this Name column we have to split the name.
"""
data = pd.read_csv('datasets/chicago.csv')
data['Name']
#spilting the name here in our dataframe we have a delimiter as comma (',')
data['Name'].str.split(',')
#this will return the series which contains list of names where 1st element as last name and second element is first name.
#get the index of 2 in dtaframe
data['Name'].str.split(',').str.get(0)
#get the number how much unique last names are there
data['Name'].str.split(',').str.get(0).nunique()

13830

In [61]:
data['Name'].str.split(',').str.get(0).str.title().value_counts()

Williams    293
Johnson     244
Smith       241
Brown       185
Jones       183
           ...
Blevins       1
Vanorny       1
Jeffrey       1
Paucar        1
Quach         1
Name: Name, Length: 13829, dtype: int64

In [63]:
#lets have a look on one more example.
"""
I want to find what th emost comman first word is among these title that exist in chicago department
"""
#split the position title by space
data['Position Title'].str.split()

0                [WATER, RATE, TAKER]
1                   [POLICE, OFFICER]
2                   [POLICE, OFFICER]
3        [CHIEF, CONTRACT, EXPEDITER]
4               [CIVIL, ENGINEER, IV]
                     ...
32058               [POLICE, OFFICER]
32059               [POLICE, OFFICER]
32060               [POLICE, OFFICER]
32061    [CHIEF, DATA, BASE, ANALYST]
32062                             NaN
Name: Position Title, Length: 32063, dtype: object

In [69]:
#get the first item in lower cases
data['Position Title'].str.split().str.get(0).str.lower()

police             10856
firefighter-emt     1509
sergeant            1186
pool                 918
firefighter          810
crossing             775
motor                721
sanitation           715
paramedic            641
asst                 606
fire                 512
traffic              512
senior               470
construction         452
lieutenant-emt       394
administrative       375
library              365
librarian            335
lieutenant           332
operating            324
Name: Position Title, dtype: int64

In [70]:
#get count and in descending order 
data['Position Title'].str.split().str.get(0).str.lower().value_counts()

police             10856
firefighter-emt     1509
sergeant            1186
pool                 918
firefighter          810
                   ...
index                  1
telephone              1
dentist                1
employability          1
warranty               1
Name: Position Title, Length: 320, dtype: int64

In [83]:
data = pd.read_csv('datasets/chicago.csv')
data['Name']

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [94]:
#one more example of split
data['Name']
#basically it consist of last name , first name connectred with middle name
#spliting the Name
data['Name'].str.split(',')#1st element as last name and 2nd element as first name combined with middle name
#return the series of 2nd element after split which consist of first and middle name
data['Name'].str.split(',').str.get(1)
#i want to extract middle name as well so in this case age we have to spily by space
data["Name"].str.split(',').str.get(1).str.split()

#return the counts of first names
data["Name"].str.split(',').str.get(1).str.split().str.get(0).value_counts()

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
           ...
GEORGI        1
SACHA         1
MONICIA       1
ZULEMA        1
CARMEL        1
Name: Name, Length: 5091, dtype: int64

# The expand and n parameter of the str.split() method

In [100]:
#as we had discussed a lot abput the split as it will retrun the series of list 
data['Name'].str.split(',')
#lets have a look on expand parameter
data['Name'].str.split(',',expand= True)
#it will return a dataframe rather than a series of python list.

               0              1
0          AARON        ELVIA J
1          AARON      JEFFERY M
2          AARON         KARINA
3          AARON    KIMBERLEI R
4        ABAD JR      VICENTE M
...          ...            ...
32058   ZYGOWICZ        PETER J
32059   ZYMANTAS         MARK E
32060  ZYRKOWSKI        CARLO E
32061  ZYSKOWSKI        DARIUSZ
32062        NaN            NaN

[32063 rows x 2 columns]

In [102]:
#creating new 2 columns of first name and last name
data[['Last Name','First Name']] = data['Name'].str.split(',',expand= True)
data

,Name,Position Title,Department,Employee Annual Salary,Last Name,First Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M
...,...,...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00,ZYGOWICZ,PETER J
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00,ZYMANTAS,MARK E
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00,ZYRKOWSKI,CARLO E
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00,ZYSKOWSKI,DARIUSZ
32062,NaN,NaN,NaN,NaN,NaN,NaN

In [104]:
#another example
data['Position Title'].str.split(expand=True)
#willl return n numbers o columns as it consist of many spaces.
#here will get the use of n which represent the number of split we want
data['Position Title'].str.split(expand = True , n = 1)

            0                   1
0       WATER          RATE TAKER
1      POLICE             OFFICER
2      POLICE             OFFICER
3       CHIEF  CONTRACT EXPEDITER
4       CIVIL         ENGINEER IV
...       ...                 ...
32058  POLICE             OFFICER
32059  POLICE             OFFICER
32060  POLICE             OFFICER
32061   CHIEF   DATA BASE ANALYST
32062     NaN                 NaN

[32063 rows x 2 columns]